function [x,y,COMPLEX_SOULTION] = getPointOnCurveFunc(point1,point2,center,r,location)
%GETPOINTONCURVESCRIPT 计算直线与圆弧的交点
%   此处显示详细说明
% (x-a)^2+(y-b)^2=r^2
% c*x+d*y=e;
%对于该问题，给定a,b,r
% [14,37.8284271200000]
% figure
% rectangle('Position',[34.8284271200000,11,6,6],'Curvature',[1,1]),axis equal
% line([37.6344780429244,38.0871757593145],[10.6326661864487,10.7818223839815])
a=center(1);
b=center(2);
% r=3;
COMPLEX_SOULTION=false;
x1=point1(1);
y1=point1(2);
x2=point2(1);
y2=point2(2);
c=y2-y1;
d=x1-x2;
e=x1*y2-x2*y1;
% 离线段近的交点
xc1=(1/2).*(c.^2+d.^2).^(-1).*((-2).*b.*c.*d+2.*a.*d.^2+2.*c.*e+ ...
  (-1).*((2.*b.*c.*d+(-2).*a.*d.^2+(-2).*c.*e).^2+(-4).*(c.^2+ ...
  d.^2).*(a.^2.*d.^2+b.^2.*d.^2+(-2).*b.*d.*e+e.^2+(-1).* ...
  d.^2.*r.^2)).^(1/2));
yc1=-(d.^(-1).*((-1).*b.*c.^2.*d.*(c.^2+d.^2).^(-1)+a.*c.*d.^2.*( ...
  c.^2+d.^2).^(-1)+(-1).*e+c.^2.*(c.^2+d.^2).^(-1).*e+(-1/2).* ...
  c.*(c.^2+d.^2).^(-1).*((2.*b.*c.*d+(-2).*a.*d.^2+(-2).*c.*e) ...
  .^2+(-4).*(c.^2+d.^2).*(a.^2.*d.^2+b.^2.*d.^2+(-2).*b.*d.*e+ ...
  e.^2+(-1).*d.^2.*r.^2)).^(1/2)));

% 远离线段的交点
xc2=(1/2).*(c.^2+d.^2).^(-1).*((-2).*b.*c.*d+2.*a.*d.^2+2.*c.*e+ ...
  ((2.*b.*c.*d+(-2).*a.*d.^2+(-2).*c.*e).^2+(-4).*(c.^2+d.^2) ...
  .*(a.^2.*d.^2+b.^2.*d.^2+(-2).*b.*d.*e+e.^2+(-1).*d.^2.* ...
  r.^2)).^(1/2));

yc2=(-1).*d.^(-1).*((-1).*b.*c.^2.*d.*(c.^2+d.^2).^(-1)+a.*c.* ...
  d.^2.*(c.^2+d.^2).^(-1)+(-1).*e+c.^2.*(c.^2+d.^2).^(-1).*e+( ...
  1/2).*c.*(c.^2+d.^2).^(-1).*((2.*b.*c.*d+(-2).*a.*d.^2+(-2) ...
  .*c.*e).^2+(-4).*(c.^2+d.^2).*(a.^2.*d.^2+b.^2.*d.^2+(-2).* ...
  b.*d.*e+e.^2+(-1).*d.^2.*r.^2)).^(1/2));
if(strcmp(location,'left'))
    if(xc1<xc2)
        x=xc1;
        y=yc1;
    else
        x=xc2;
        y=yc2;
    end
elseif(strcmp(location,'right'))
    if(xc1<xc2)
        x=xc2;
        y=yc2;
    else
        x=xc1;
        y=yc1;
    end
else
    err('方向定义错误，仅可使用left和right')
end
if ~isreal(x) || ~isreal(y)
    COMPLEX_SOULTION=true;
end
end
